# rpn_calc
A Simple Reverse Polish Notation Calculator in Ruby

# Installation
```
> git clone https://github.com/danlherman/rpn_calc
> cd rpn_calc
> bundle install
> chmod +x ./calc
```

# Usage
Run calculator from the CLI with: 
./calc

You can calculate numbers one at a time:
```
> 9
9
> 3
3
> +
12
```

or all on one line:
```
> 9 3 +
12
```

Exit the calculator with:
```
> q
```
